[Killed] ArrayDeclaration
src/gilded_rose.refactor.js:10:23
 }
 
 class Shop {
-  constructor(items = []) {
+  constructor(items = ["Stryker was here"]) {
     this.items = items;
   }
killedBy: Gilded Rose - updateQuality Shop - cenários de inventário não deve falhar e deve manter inventário vazio quando não há itens na loja
statusReason: TypeError: Cannot create property 'sellIn' on string 'Stryker was here'

[Killed] BlockStatement
src/gilded_rose.refactor.js:14:20
     this.items = items;
   }
 
-  isAgedBrie(item) {
-    return item.name === "Aged Brie";
-  }
+  isAgedBrie(item) {}
 
   isBackstage(item) {
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:15:12
   }
 
   isAgedBrie(item) {
-    return item.name === "Aged Brie";
+    return true;
   }
 
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 21

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:15:12
   }
 
   isAgedBrie(item) {
-    return item.name === "Aged Brie";
+    return false;
   }
 
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] BlockStatement
src/gilded_rose.refactor.js:18:21
     return item.name === "Aged Brie";
   }
 
-  isBackstage(item) {
-    return item.name === "Backstage passes to a TAFKAL80ETC concert";
-  }
+  isBackstage(item) {}
 
   isSulfuras(item) {
killedBy: Gilded Rose - updateQuality Backstage passes deve aumentar quality em 1 com mais de 10 dias restantes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:19:12
   }
 
   isBackstage(item) {
-    return item.name === "Backstage passes to a TAFKAL80ETC concert";
+    return true;
   }
 
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 22

[Killed] EqualityOperator
src/gilded_rose.refactor.js:19:12
   }
 
   isBackstage(item) {
-    return item.name === "Backstage passes to a TAFKAL80ETC concert";
+    return item.name !== "Backstage passes to a TAFKAL80ETC concert";
   }
 
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 22

[Killed] BlockStatement
src/gilded_rose.refactor.js:22:20
     return item.name === "Backstage passes to a TAFKAL80ETC concert";
   }
 
-  isSulfuras(item) {
-    return item.name === "Sulfuras, Hand of Ragnaros";
-  }
+  isSulfuras(item) {}
 
   increaseQuality(item) {
killedBy: Gilded Rose - updateQuality Sulfuras, Hand of Ragnaros não deve alterar sellIn nem quality antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 9

[Killed] EqualityOperator
src/gilded_rose.refactor.js:23:12
   }
 
   isSulfuras(item) {
-    return item.name === "Sulfuras, Hand of Ragnaros";
+    return item.name !== "Sulfuras, Hand of Ragnaros";
   }
 
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:23:12
   }
 
   isSulfuras(item) {
-    return item.name === "Sulfuras, Hand of Ragnaros";
+    return true;
   }
 
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] BlockStatement
src/gilded_rose.refactor.js:26:25
     return item.name === "Sulfuras, Hand of Ragnaros";
   }
 
-  increaseQuality(item) {
-    if (item.quality < 50) {
-      item.quality = item.quality + 1;
-    }
-  }
+  increaseQuality(item) {}
 
   decreaseQuality(item) {
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] BlockStatement
src/gilded_rose.refactor.js:27:28
   }
 
   increaseQuality(item) {
-    if (item.quality < 50) {
-      item.quality = item.quality + 1;
-    }
+    if (item.quality < 50) {}
   }
 
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] EqualityOperator
src/gilded_rose.refactor.js:27:9
   }
 
   increaseQuality(item) {
-    if (item.quality < 50) {
+    if (item.quality >= 50) {
       item.quality = item.quality + 1;
     }
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] ArithmeticOperator
src/gilded_rose.refactor.js:28:22
 
   increaseQuality(item) {
     if (item.quality < 50) {
-      item.quality = item.quality + 1;
+      item.quality = item.quality - 1;
     }
   }
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] BlockStatement
src/gilded_rose.refactor.js:32:25
     }
   }
 
-  decreaseQuality(item) {
-    if (item.quality > 0) {
-      item.quality = item.quality - 1;
-    }
-  }
+  decreaseQuality(item) {}
 
   updateBackstageQualityBeforeSellIn(item) {
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 20

[Killed] EqualityOperator
src/gilded_rose.refactor.js:33:9
   }
 
   decreaseQuality(item) {
-    if (item.quality > 0) {
+    if (item.quality >= 0) {
       item.quality = item.quality - 1;
     }
killedBy: Gilded Rose - updateQuality Itens comuns não deve deixar quality negativa para item comum com quality 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:33:9
   }
 
   decreaseQuality(item) {
-    if (item.quality > 0) {
+    if (true) {
       item.quality = item.quality - 1;
     }
killedBy: Gilded Rose - updateQuality Itens comuns não deve deixar quality negativa para item comum com quality 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] ArithmeticOperator
src/gilded_rose.refactor.js:34:22
 
   decreaseQuality(item) {
     if (item.quality > 0) {
-      item.quality = item.quality - 1;
+      item.quality = item.quality + 1;
     }
   }
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 21

[Killed] BlockStatement
src/gilded_rose.refactor.js:38:44
     }
   }
 
-  updateBackstageQualityBeforeSellIn(item) {
-    // aumento base
-    this.increaseQuality(item);
-    if (item.sellIn < 11) {
-      this.increaseQuality(item);
-    }
-    if (item.sellIn < 6) {
-      this.increaseQuality(item);
-    }
-  }
+  updateBackstageQualityBeforeSellIn(item) {}
 
   updateExpiredItem(item) {
killedBy: Gilded Rose - updateQuality Backstage passes deve aumentar quality em 1 com mais de 10 dias restantes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] BlockStatement
src/gilded_rose.refactor.js:41:27
   updateBackstageQualityBeforeSellIn(item) {
     // aumento base
     this.increaseQuality(item);
-    if (item.sellIn < 11) {
-      this.increaseQuality(item);
-    }
+    if (item.sellIn < 11) {}
     if (item.sellIn < 6) {
       this.increaseQuality(item);
killedBy: Gilded Rose - updateQuality Backstage passes deve aumentar quality em 2 com exatamente 10 dias restantes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22
Received: 21

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:41:9
   updateBackstageQualityBeforeSellIn(item) {
     // aumento base
     this.increaseQuality(item);
-    if (item.sellIn < 11) {
+    if (true) {
       this.increaseQuality(item);
     }
killedBy: Gilded Rose - updateQuality Backstage passes deve aumentar quality em 1 com mais de 10 dias restantes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 22

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:44:9
     if (item.sellIn < 11) {
       this.increaseQuality(item);
     }
-    if (item.sellIn < 6) {
+    if (true) {
       this.increaseQuality(item);
     }
killedBy: Gilded Rose - updateQuality Backstage passes deve aumentar quality em 1 com mais de 10 dias restantes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 22

[Killed] BlockStatement
src/gilded_rose.refactor.js:49:27
     }
   }
 
-  updateExpiredItem(item) {
-    if (this.isAgedBrie(item)) {
-      // Brie ganha +1 extra após o vencimento
-      this.increaseQuality(item);
-      return;
-    }
-
-    if (this.isBackstage(item)) {
-      // Backstage perde todo o valor
-      item.quality = 0;
-      return;
-    }
-
-    // Common (e Conjured na implementação atual) degradam novamente
-    this.decreaseQuality(item);
-  }
+  updateExpiredItem(item) {}
 
   updateQuality() {
killedBy: Gilded Rose - updateQuality Itens comuns deve degradar quality em 2 para item comum quando sellIn era 0 (vencimento)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 19

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:50:9
   }
 
   updateExpiredItem(item) {
-    if (this.isAgedBrie(item)) {
+    if (true) {
       // Brie ganha +1 extra após o vencimento
       this.increaseQuality(item);
killedBy: Gilded Rose - updateQuality Itens comuns deve degradar quality em 2 para item comum quando sellIn era 0 (vencimento)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 20

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:50:9
   }
 
   updateExpiredItem(item) {
-    if (this.isAgedBrie(item)) {
+    if (false) {
       // Brie ganha +1 extra após o vencimento
       this.increaseQuality(item);
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 2 após o vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22
Received: 20

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:56:9
       return;
     }
 
-    if (this.isBackstage(item)) {
+    if (false) {
       // Backstage perde todo o valor
       item.quality = 0;
killedBy: Gilded Rose - updateQuality Backstage passes deve zerar quality no dia do show
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 22

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:56:9
       return;
     }
 
-    if (this.isBackstage(item)) {
+    if (true) {
       // Backstage perde todo o valor
       item.quality = 0;
killedBy: Gilded Rose - updateQuality Itens comuns deve degradar quality em 2 para item comum quando sellIn era 0 (vencimento)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 0

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:70:11
     for (let i = 0; i < this.items.length; i++) {
       const item = this.items[i];
 
-      if (this.isSulfuras(item)) {
+      if (false) {
         // Sulfuras nunca muda
         continue;
killedBy: Gilded Rose - updateQuality Sulfuras, Hand of Ragnaros não deve alterar sellIn nem quality antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 9

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:70:11
     for (let i = 0; i < this.items.length; i++) {
       const item = this.items[i];
 
-      if (this.isSulfuras(item)) {
+      if (true) {
         // Sulfuras nunca muda
         continue;
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] BlockStatement
src/gilded_rose.refactor.js:76:34
       }
 
       // Pré-vencimento
-      if (this.isAgedBrie(item)) {
-        this.increaseQuality(item);
-      } else if (this.isBackstage(item)) {
+      if (this.isAgedBrie(item)) {} else if (this.isBackstage(item)) {
         this.updateBackstageQualityBeforeSellIn(item);
       } else {
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:76:11
       }
 
       // Pré-vencimento
-      if (this.isAgedBrie(item)) {
+      if (false) {
         this.increaseQuality(item);
       } else if (this.isBackstage(item)) {
killedBy: Gilded Rose - updateQuality Aged Brie deve aumentar quality em 1 antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:78:18
       // Pré-vencimento
       if (this.isAgedBrie(item)) {
         this.increaseQuality(item);
-      } else if (this.isBackstage(item)) {
+      } else if (true) {
         this.updateBackstageQualityBeforeSellIn(item);
       } else {
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 22

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:78:18
       // Pré-vencimento
       if (this.isAgedBrie(item)) {
         this.increaseQuality(item);
-      } else if (this.isBackstage(item)) {
+      } else if (false) {
         this.updateBackstageQualityBeforeSellIn(item);
       } else {
killedBy: Gilded Rose - updateQuality Backstage passes deve aumentar quality em 1 com mais de 10 dias restantes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] BlockStatement
src/gilded_rose.refactor.js:80:14
         this.increaseQuality(item);
       } else if (this.isBackstage(item)) {
         this.updateBackstageQualityBeforeSellIn(item);
-      } else {
-        // item comum (inclui Conjured)
-        this.decreaseQuality(item);
-      }
+      } else {}
 
       // Atualiza sellIn (não se aplica a Sulfuras, já filtrado)
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 20

[Killed] ArithmeticOperator
src/gilded_rose.refactor.js:86:21
       }
 
       // Atualiza sellIn (não se aplica a Sulfuras, já filtrado)
-      item.sellIn = item.sellIn - 1;
+      item.sellIn = item.sellIn + 1;
 
       // Pós-vencimento
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 11

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:89:11
       item.sellIn = item.sellIn - 1;
 
       // Pós-vencimento
-      if (item.sellIn < 0) {
+      if (false) {
         this.updateExpiredItem(item);
       }
killedBy: Gilded Rose - updateQuality Itens comuns deve degradar quality em 2 para item comum quando sellIn era 0 (vencimento)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 19

[Killed] ConditionalExpression
src/gilded_rose.refactor.js:89:11
       item.sellIn = item.sellIn - 1;
 
       // Pós-vencimento
-      if (item.sellIn < 0) {
+      if (true) {
         this.updateExpiredItem(item);
       }
killedBy: Gilded Rose - updateQuality Itens comuns deve diminuir quality em 1 para item comum antes do vencimento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 18
